'''
@author: lgx
@Email:297979949@qq.com
@project: python_study
@file: 111.py
@time: 2019-07-01 13:46
@desc:
'''

a=['深圳市汉京物业服务有限公司汉京大厦地下停车场',
'北京雅宏停车服务有限公司',
'广州市保丰物业管理有限公司',
'厦门市建坤诚兴物业有限公司',
'中航物业管理有限公司龙岗区人民医院停车场',
'烟台国际机场集团有限公司航空实业分公司',
'山西万家物业管理有限公司',
'山西日报传媒（集团）物业管理有限责任公司',
'厦门天润星辰物业管理有限公司',
'厦门市成功大酒店有限公司',
'广东顺德佳德业置业投资有限公司',
'上海福克斯资产管理有限公司',
'上海焦点实业有限公司',
'北京岁豪汇俊物业管理服务有限公司']
b=['91440300568513650N',
'91110105556872453J',
'91440104668141049Q',
'913502002601487225',
'91440300MA5F73XD2B',
'91370600796173950H',
'911401005759783843',
'91140106317172126P',
'91350200MA32F50P4X',
'91350200581295248D',
'91440606061478243A',
'91310112051203908L',
'91310112687354293N',
'91110105MA0079915R'
]
l=len(a)
for i in range(l):
    print("'"+a[i]+"'"+":"+"'"+b[i]+"'"+",")