'''
@author: lgx
@Email:297979949@qq.com
@project: python_study
@file: 注册码归类.py
@time: 2019-06-11 15:26
@desc:
'''

import os
import shutil

dir={'东莞市永安石油化工有限公司第二加油站':'914419007192624312',
        '博罗龙华粤美特加油站有限公司':'914413221961288306',
        '广州市花都区赤坭镇乌石加油站':'91440101191205315H',
        '深圳市雄伟李氏经贸物资有限公司威程油气站':'91440300761978388R',
        '深圳市顺归加油站有限公司':'91440300731109309T',
        '四会市凯平加油站有限公司':'91441284MA4UN7452U',
        '西安市长安区八一加油站':'91610116726273243X',
        '中山市古镇七坊加油站':'914420002820415980',
        '深圳市宝安广安冠德石油贸易有限公司上南加油站':'91440300892472424C',
        '台福油品（深圳）有限公司坪地加油站':'914403000638981370',
        '广州市海珠区江南石溪加油站':'9144010173155367XT',
        '东莞市黄江东盛加油站有限公司':'914419000506533418',
        '济南鉴德石油化工有限公司':'91370103787448537Q',
        '山东中惠泽石油有限公司':'91370103575478769F',
        '成都鸿浩加气站有限公司':'915101325535515157',
        '深圳市西润加油站有限公司':'9144030027939419XE'
}
file_list=os.listdir("C:/Users/lgx/Desktop/冠德石化0611/84_20190611_151430/84_20190611_151430")

for i in dir:

    #os.makedirs("C:/Users/lgx/Desktop/冠德正式jp80注册码/{mingcheng}".format(mingcheng=i),exist_ok=True)
    #print(dir[i])

    for j in file_list:

        if dir[i] in j :
            print(i,j)
            str="C:/Users/lgx/Desktop/冠德石化0611/84_20190611_151430/84_20190611_151430/{file}".format(file=j)
            dst="C:/Users/lgx/Desktop/冠德正式jp80注册码/{mingcheng}".format(mingcheng=i)
            shutil.move(str,dst)


